---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailPathCloseLoopForExtensionWarning
source: html/0a9cbf71-3df2-595e-5522-2e4e9b019fd0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailPathCloseLoopForExtensionWarning Property

The rail path is closed at the start and end path point for extension creation.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailPathCloseLoopForExtensionWarning { get; }
```